{"pageProps":{"allPosts":[{"slug":"my-wfh-desk-setups-2022","title":"My productive WFH setup introduction and desk tour of 2022","excerpt":"Last year, I was WFH for most of time, that made me to reconsider my desktop setups and working environment at home. I did some research, DIY some gadgets, bought some LED strips, two monitors, monitor stands, mechanical keyboard and new mouse. Iteratively to change the layout and reorganize the cables. It was a such great time to rethinking how the setups and arrangements can affect my daily work and productivity.","keywords":"","author":{"name":"Andy Cao","picture":"/static/images/avatar-pixel.jpg"},"content":"","coverImage":"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/front-setups-1.jpg","date":"2020-07-04T05:35:07.322Z"},{"slug":"new-apple-silicon-m1-pro-macbook-pro-hands-on","title":"New Apple Silicon M1 Pro Chip MacBook Pro Hands-on and First Impression","excerpt":"I have used this M1 Pro Chip MacBook Pro for about one week now. I have to say it’s really fast! I can not feel any lagging issues during my daily development workflow. Additionally, the 120 Herts refresh rate gives me a new level of screen experience.","keywords":"","author":{"name":"Andy Cao","picture":"/static/images/avatar-pixel.jpg"},"content":"","coverImage":"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/IMG_9826.jpg","date":"2020-04-02T05:35:07.322Z"},{"slug":"make-a-usb-type-c-holder-on-my-desk","title":"Cable management solution: how to keep clean when I move the laptop outside the desk","excerpt":"Recently, I am obsessed with reordering or organizing my little pieces of stuff. For example, cable management is a great topic it is hard to say it’s perfect at any time. How to organize your tools or material make them easy to store and find is really a fascinating challenge.","keywords":"","author":{"name":"Andy Cao","picture":"/static/images/avatar-pixel.jpg"},"content":"","coverImage":"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-cover-image.jpg","date":"2020-03-26T05:35:07.322Z"}]},"__N_SSG":true}