{"pageProps":{"post":{"slug":"make-a-usb-type-c-holder-on-my-desk","title":"Cable management solution: how to keep clean when I move the laptop outside the desk","excerpt":"Recently, I am obsessed with reordering or organizing my little pieces of stuff. For example, cable management is a great topic it is hard to say it’s perfect at any time. How to organize your tools or material make them easy to store and find is really a fascinating challenge.","keywords":"cable management, cable management desk, cable management ideas, cable management tray, wfh setups, developer desk, cable management tips, developer desk setup, dev desk setup","author":{"name":"Andy Cao","picture":"/static/images/avatar-pixel.jpg"},"content":"<h1>Reason and background</h1>\n<p>Recently, I am obsessed with reordering or organising my little pieces of stuff. For example, cable management is a great topic it is hard to say it’s perfect at any time. How to organise your tools or material make them easy to store and find is really a fascinating challenge.</p>\n<p>These few days, I started to get noticed the 2 USB type-c to HDML cables. I have 2 cables, they are used for connecting my laptop to my 2 external monitors. Normally I use only one monitor, sometimes two, which mean that one of the cables may be hanging in some corner of the desk, or just lay on the table randomly.</p>\n<ul>\n<li>\n<p>The cables are everywhere, looks messy. If there are not too many other pieces of stuff, it looks alright, but if there’re already many items on the table, it looks even messier.</p>\n</li>\n<li>\n<p>It makes finding your cable a little bit harder. May need extra 2-3 secs</p>\n</li>\n</ul>\n<p>I think for the vast majority of people, it is not an issue, it can be ignored for sure. But sometimes you just want to solve this kind of problem with strong intent.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-cables-on-the-table.jpeg\" alt=\"Cables\"></p>\n<h1>Solutions</h1>\n<p>How to solve this problem? there must be lots of ways. I got <strong>3 solutions</strong> in my mind:</p>\n<ol>\n<li>Use the <strong>rubber band</strong> to tie the cable under the desktop mount</li>\n<li>Put all the idle cables behind the desk</li>\n<li>Make a <strong>fake</strong> USB <strong>Type-C female socket</strong> and when I don’t use the cable, just plug it into it. Just like plugging into the laptop</li>\n</ol>\n<p>Obviously, I prefer the <strong>3rd solution</strong>. It looks elegant and easy to find the cables. It helps to keep my desktop consistent. Alright, that’s it. Let’s make it out.</p>\n<h1>Design</h1>\n<p>First, I sketch out the rough idea with pencil and paper, here I planned to put 2 Type-C ports on the holder. You may need more if you have more cable connectors.</p>\n<p>After that, I started to use <strong>Fusion 360</strong> to model the 3D version.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-design-process.mov.gif\" alt=\"Design process animation\"></p>\n<p>I modelled several different versions. Finally, I think I got what I want.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-different-models.png\" alt=\"Different versions\"></p>\n<h1>Print and Install</h1>\n<p>Every time I make a new design, I always can not wait to print it out. Most of the time it is not perfect, I may have something missing, did not consider all the potential situations. But I am very enjoying the moment that I print it out and put it in my hand. From a certain point of view, bringing it to reality to feel the weight and size, gives me more thoughts on the design. It also prevents further, <strong>bigger mistakes</strong>.</p>\n<p>I am not a 3d model design export, it’s pretty hard for me to design a new model. But I feel I am getting better.</p>\n<p>Back to the holder, the first printing is as always failed. I measured error size of the hold on my laptop mount.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-printed-failed.jpeg\" alt=\"Failed design\"></p>\n<p>This time the port of Type-C is too small, I cannot plug my connectors in.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-printed-failed-2.jpeg\" alt=\"Failed design\"></p>\n<p>Finally, I made everything fits.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-mount-on.jpeg\" alt=\"Mount on the laptop tray\"></p>\n<p>Put all the calbes on it.</p>\n<p><img src=\"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-final-one-with-cables.jpeg\" alt=\"Final result\"></p>\n<p>After the successful experiment, I extended this idea to other places which have idle cables, they are working very well so far.</p>\n<h1>Conclusion</h1>\n<p>This is a really simple example of using 3d design software and 3d print to solve some problem in daily life. Although it’s a very small project, you need to go through all the processes. From <strong>idea generation</strong>, <strong>design</strong> and <strong>printing</strong>.</p>\n<p>Compare to years ago, with the help of 3D software and 3D printer, I think it becomes way more easier to output your idea from your mind to reality. If you have some ideas you think it may change you life, just go for it, it’s not hard at all. I am very looking forward to see you design and sharing in the 3d printing community</p>\n<p>If you’re interested in my design you can download it via <a href=\"https://www.thingiverse.com/thing:5346194\"><strong>ThingyVerse</strong></a> and if you have any idea very happy to see you remix it or leave some <a href=\"https://www.thingiverse.com/thing:5346194/comments\"><strong>comments here</strong></a> to help me to improve my design.</p>\n","coverImage":"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-cover-image.jpg","date":"2020-03-26T05:35:07.322Z","ogImage":{"url":"https://raw.githubusercontent.com/f1982/planet-of-images/main/img/usbc-holder-cover-image.jpg"}}},"__N_SSG":true}